{
  "Backyard_women": "Generate a scene of a European female model with ((perfectly drawn hands 1.4)), Wearing, paired with light-wash relaxed-fit ripped jeans with distressed knee details, and completed with black open-toe block heels,. ((standing in a stylish outdoor courtyard, one hand on her hip and the other gently touching the hem of her skirt)), ((modern courtyard with clean lines, concrete walkways, potted plants, and geometric sculptures in the background, creating an artistic and minimalistic urban setting 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).Lighting: soft, even sunlight with a hint of shadows, highlighting the model’s silhouette and the smooth texture of the dress. Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Hotel Lobby_women": "Generate a scene of a European female model with ((perfectly drawn hands 1.4)), Wearing ((in a relaxed pose in a modern, bright hotel lobby, one hand resting on her hip and the other holding a small handbag, with a composed expression 1.3)), ((bright and spacious hotel lobby with light wood paneling, polished floors, modern lighting, and contemporary furniture with minimalist décor, creating a fresh and welcoming atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: bright, neutral hotel lighting that illuminates the model and dress perfectly, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Office1_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing((walking confidently through a bright, themed office lobby, exuding a poised and professional demeanor 1.3)), ((high-end corporate office with floor-to-ceiling glass windows, polished marble flooring, contemporary decor, and a sleek reception desk, bathed in natural daylight 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)), Lighting: bright lighting with soft shadows to emphasize the outfit, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Street1_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently along a stylish urban street, exuding effortless summer elegance and confidence 1.3)), ((modern city street with clean sidewalks, neutral-toned buildings with large glass windows, subtle architectural details, and soft natural lighting creating a balanced and professional atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft and even, avoiding dramatic highlights or strong shadows, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Wooden pier by the lake_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair,with ((perfectly drawn hands 1.4)), wearing ((standing confidently on a wooden pier, one hand resting on her hip, the other holding her handbag, exuding a relaxed and stylish vibe 1.3)), ((simple wooden pier with natural wood grain and weathered planks, minimalistic and rustic with soft lighting filtering through nearby trees, offering a clean and calm atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: gentle natural sunlight, creating soft shadows and highlights on the wooden surface, enhancing the model’s silhouette and outfit. Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Botanical glasshouse_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands:1.4)), wearing ((standing confidently in a botanical glasshouse, one hand resting on her hip, the other holding her handbag, exuding a relaxed and stylish vibe:1.3)), ((sunlit glasshouse interior with tall arched windows, large tropical plants, potted greenery, and a stone-tiled floor, dappled sunlight filtering through leaves creating soft light patterns:1.3)), in a clean style, detailed, ((professional apparel photography:1.4)).  Lighting: natural diffused sunlight, soft shadows and warm highlights, enhancing fabric and silhouette. Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Rooftop_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands:1.4)), wearing ((standing confidently on a sunlit rooftop terrace, one hand resting casually in her pocket while the other hangs loosely by her side, exuding a cool, relaxed vibe:1.3)), ((modern rooftop with light concrete flooring, glass railings, a few potted plants, and soft shadows cast by nearby structures, overlooking a subtle city skyline:1.3)), in a clean style, detailed, ((professional apparel photography:1.4)). Lighting: soft natural light with even shadowing, ensuring the model and outfit are clearly highlighted. Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Sidewalk View_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair,with ((perfectly drawn hands 1.4)),, wearing ((set against an elegant European-style cityscape with classic beige stone buildings, large windows, and greenery-filled window boxes, creating a cozy and urban aesthetic 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft natural daylight with subtle shadows, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Green tropical leaves_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((posing gracefully against a textured white brick wall adorned with green tropical leaves, exuding an effortlessly chic and modern vibe 1.3)), ((bright outdoor-inspired studio setup with soft natural lighting, creating a fresh and stylish atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft and even to highlight fabric textures, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Mediterranean courtyard_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking gracefully along spacious stone steps in a Mediterranean courtyard, exuding an elegant yet casual 1.3)), ((greenery, creating a serene and inviting ambiance 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: warm and natural, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Town setting_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing((walking gracefully along a picturesque Mediterranean street, exuding effortless elegance and a summer-ready look 1.3)), ((rustic European town setting with warm yellow stucco walls, deep green wooden shutters, cobblestone streets, and vibrant pink bougainvillea cascading from above, creating a dreamy and charming atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft natural sunlight for a warm and inviting feel, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Garden_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking gracefully through a spacious garden, exuding effortless summer elegance and confidence 1.3)), ((open garden with a white picket fence, well-manicured green grass, and soft natural light evenly illuminating the scene, creating a serene and refreshing ambiance 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: soft and even, avoiding dramatic highlights or strong shadows, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Courtyard_women": "Generate a scene of a 23 years European female model with ((perfectly drawn hands 1.4)), wearing ((model standing gracefully beside a white Mediterranean-style wall, hands softly by her side, expression serene and elegant 1.3)), ((sunlit outdoor courtyard with blooming bougainvillea tree, rustic stairs, and textured whitewashed walls in a warm European village setting 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: golden hour sunlight with soft shadows, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Urban street_women": "Generate a scene of a 23 years European female model with ((perfectly drawn hands 1.4)), wearing(, walking confidently on a city sidewalk , ((modern urban street setting with textured walls, light stone pavement, and subtle background elements like a bicycle and warm sunlight 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft natural daylight with gentle contrast, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Sunny autumn street_women": "Generate a scene of a 23 years European female model with ((perfectly drawn hands 1.4)), wearing((model standing in a relaxed pose by an ornate black iron fence, holding a flower near her face with a soft smile, bathed in warm morning light 1.3)), ((autumn street with fallen leaves, soft tree shadows, and a calm peaceful atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: soft fall tones, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Cobblestone street_women": "Generate a scene of a 23 years European female model with ((perfectly drawn hands 1.4)), wearing ((model walking along a cobblestone street with a relaxed expression, holding a folded newspaper in one hand, hair gently blown by the breeze 1.3)), ((rustic European alley with aged beige walls, wooden windows, and old stone pavement evoking vintage charm 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft natural daylight with golden undertones, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Vintage urban_women": "Generate a scene of a 23 years European female model with ((perfectly drawn hands 1.4)), wearing((model standing on an old city street with a nostalgic look, arms gently relaxed by her sides, head tilted slightly back with a soft smile 1.3)), ((vintage urban background with weathered stone buildings, creeping red vines, and rustic doors in an Armenian town setting 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half body pose, Lighting: soft overcast daylight, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Rustic mustard-yellow wall_women": "Generate a scene of a fashionable European female model with ((perfectly drawn hands 1.4)), wearing ((standing in a relaxed pose 1.3)), ((in front of a rustic mustard-yellow wall with a traditional wooden window and decorative iron grill, cobblestone pavement underfoot 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: natural soft daylight, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "European plaza_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently across a grand European plaza, exuding a bold and fashion-forward urban look 1.3)), ((elegant and empty European courtyard featuring detailed stone architecture, large arched windows, and clean symmetrical elements with no people in the background, creating a calm and refined setting 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: natural daylight, soft and even, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "White stone_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently along a sunlit neoclassical city street, exuding minimal elegance and a sharp summer style 1.3)), ((urban street with white stone architecture, tall pillars, arched windows:1, and a clean sidewalk, bathed in soft daylight with no visual clutter or people around, creating a refined and architectural ambiance 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft natural daylight with crisp shadows, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "European street_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently along a sunlit cobblestone alleyway in a quaint southern European town, exuding relaxed summer charm and effortless style 1.3)), ((narrow European street with warm beige stone walls, rustic wooden doors, climbing ivy, scattered terracotta pots, and soft natural daylight casting gentle shadows for a cozy, lived-in Mediterranean vibe 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: soft natural daylight, evenly lit with no harsh highlights, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Seafront_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking effortlessly along a bright wooden coastal pier, exuding carefree summer energy and fresh coastal charm 1.3)), ((open seafront boardwalk with light wood planks, clear blue water, soft horizon, minimal boats in the distance, and clean sky with gentle breeze moving the hair and outfit 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: bright natural sunlight with soft shadows, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Courtyard2_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking slowly through a sunlit Mediterranean villa courtyard, exuding calm confidence and effortless resort style 1.3)), ((courtyard with terracotta walls, aged wooden doors, stone flooring, arched windows, potted olive trees, and climbing vines bathed in warm natural daylight 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: soft golden daylight with natural contrast, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Modern art_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing confidently outside a modern art museum, exuding strong minimalism and high-fashion street elegance 1.3)), ((architectural space with sharp geometric lines, white concrete walls, glass panels, open plaza flooring, and soft natural light casting defined shadows for a futuristic urban aesthetic 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: bright natural light with architectural shadows, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Linen-draped_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing calmly in a linen-draped indoor corner, exuding softness, warmth, and natural elegance 1.3)), ((minimal space with matte plastered walls in light beige tones, floor-to-ceiling white linen curtains flowing gently, and natural wood flooring — no people or props in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: soft, filtered natural light through curtains, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Sandy coastal_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking along a sandy coastal path, exuding effortless coastal charm and understated confidence 1.3)), ((natural setting with soft sand underfoot, wooden dune fencing on both sides, sparse beach grass, and a clear sky above — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: natural sunlit scene with soft warm highlights, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Pastel courtyard_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking through a pastel-toned courtyard, exuding feminine ease and quiet confidence 1.3)), ((open courtyard with peach and muted yellow walls, light ceramic tiled flooring, arched doorways, and subtle greenery in terracotta pots — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: soft natural daylight with warm pastel reflections, Contrast Color, ultra photorealistic, highlighting textures and details,., crisp focus, HD quality.",
  "Pebble-paved path_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking slowly along a detailed pebble-paved path, exuding effortless grace and calm summer confidence 1.3)), ((clearly visible pebble stone flooring in light neutral tones, flanked by whitewashed textured walls, rustic wooden doors, potted green plants, and climbing ivy across the corners — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: natural daylight with crisp, even shadows, Contrast Color, ultra photorealistic, highlighting both outfit and background textures and details, full focus, HD quality.",
  "Sunlit Mediterranean alley_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking casually through a narrow sunlit Mediterranean alley, exuding fresh summer charm and confident ease 1.3)), ((fully detailed background with warm pastel-toned stucco walls, stone pavement, arched wooden doorways, green window shutters, and bougainvillea vines climbing the walls — all clearly in focus, no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: direct natural sunlight with crisp shadows, Contrast Color, ultra photorealistic, sharp focus on both model and intricate background elements, highlighting textures and details, HD quality.",
  "Villa-style stone pathway_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing (walking along a villa-style stone pathway, exuding laid-back elegance and Mediterranean warmth 1.3)), ((fully detailed background with textured beige stone pavement, light sandstone walls, arched doorways, climbing vines, and potted plants along the path — all clearly visible and in focus, no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: natural daylight with warm highlights and crisp shadows, Contrast Color, ultra photorealistic, sharp focus on both model and background, highlighting textures and details, HD quality.",
  "Loft-style indoor space_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing confidently in a loft-style indoor space with exposed brick walls, exuding contemporary style and artistic edge 1.3)), ((fully detailed background featuring warm red or whitewashed brick walls, tall industrial windows with black metal framing, polished concrete flooring, and a soft leather accent chair or potted plant placed nearby — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: soft natural light from large windows with defined but gentle shadows, Contrast Color, ultra photorealistic, sharp focus on both model and environment textures, HD quality.",
  "Sunlit city sidewalk_women": "Generate a half body scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking casually along a sunlit city sidewalk, exuding everyday confidence and fresh summer style 1.3)), ((fully detailed background featuring neutral-toned storefronts, stone pavement, clean signage, planters along the walkway, and natural 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: natural light with gentle shadows, Contrast Color, ultra photorealistic, sharp focus on both model and surroundings, HD quality.",
  "Whitewashed villa terrace_women": "Generate a scene of a young European female model (23 years old) with a white skin tone, light brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing confidently on a whitewashed villa terrace, exuding relaxed elegance and summery poise 1.3)), ((fully detailed background featuring smooth white stucco walls, exposed wooden beams overhead, terracotta ceramic planters with greenery, and patterned floor tiles under soft natural light — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft Mediterranean daylight with light shadows from beams, Contrast Color, ultra photorealistic, sharp focus on both model and surrounding textures, HD quality.",
  "Indoor_Sofa1_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, one hand resting on her hip, the other by her side, exuding a casual and confident vibe 1.3)), ((modern indoor setting with dark wooden flooring, a light beige sofa with minimal cushions, and a soft, inviting ambiance 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft, diffused natural daylight, ultra photorealistic, highlighting fabric textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Indoor_Closet_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed, confident pose, one hand gently resting on her hip, the other at her side 1.3)), ((minimal walk-in closet setting with light wood flooring, clean white walls, and a clothing rack displaying neatly organized neutral-toned garments, with a white handbag placed on the floor 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft natural daylight, ultra photorealistic, highlighting fabric texture, depth of field, crisp focus, HD quality.",
  "Indoor_Dining_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed and confident pose, one hand holding a woven handbag, exuding effortless elegance and charm 1.3)), ((indoor dining area with light wood flooring, a wooden dining table with cross-legged chairs, greenery in the background, and decorative macrame and vase elements 1.3)), in a clean, minimalistic style with a cozy ambiance, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle focus on the upper body, Lighting: soft natural daylight, ultra photorealistic, highlighting fabric texture, skin details, and accessories, depth of field, crisp focus, HD quality.",
  "Indoor_Landing_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing  ((standing full body with a relaxed pose, one hand casually resting on her side, the other holding a large brown leather handbag, exuding effortless elegance 1.3)), ((simple staircase landing area with soft neutral carpeting, clean white walls, and a set of stairs with a wooden handrail, softly illuminated by natural light from a doorway above 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, ensuring the model’s face is visible and framed naturally, Lighting: soft natural daylight from an open doorway, ultra photorealistic, highlighting the textures of the clothing, skin tones, and accessories, with subtle depth of field, crisp focus, HD quality.",
  "Indoor_Room1_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a confident, relaxed pose, one hand lightly resting on a chair, the other by her side, exuding chic elegance 1.3)), ((indoor modern living space with light wood flooring, a geometric rug, large windows letting in natural daylight, and soft greenery visible outside 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: soft natural daylight with a touch of overhead chandelier light, ultra photorealistic, highlighting the garment's texture, skin details, and the soft play of light, depth of field, crisp focus, HD quality.",
  "Indoor_Bedroom_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed, confident pose, one hand placed lightly on her hip, the other by her side, maintaining a natural, proportional scale that aligns with the room’s size 1.3)), ((simple, clean, and minimalistic bedroom with dark wood flooring, a white bed with neutral bedding, and a small side table beside the bed — ensuring the model’s proportions are in perfect harmony with the furniture and the room's space 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, ensuring the model's scale is natural relative to the surroundings, Lighting: soft natural daylight or gentle indoor light, ultra photorealistic, highlighting fabric textures, skin details, and room elements, with proper depth of field, crisp focus, HD quality.",
  "Outdoor_Alley2_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed, confident pose, one hand naturally by her side, the other slightly bent with a casual, effortless stance 1.3)), ((outdoor urban setting with a clean, light-colored wall, black-framed window to the left, and a gray sidewalk at the base of the image, softly illuminated by bright natural daylight 1.3)), in a clean, modern style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: bright natural daylight with soft shadows, ultra photorealistic, highlighting the garment’s texture, skin details, and natural pose, with crisp focus, depth of field, and HD quality.",
  "Outdoor_Dining_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, one hand resting naturally by her side, the other holding the shoulder strap of a small handbag, exuding effortless style and confidence 1.3)), ((outdoor café area with light wood flooring, a smooth beige textured wall, simple wooden chairs, and soft natural daylight filtering through the space 1.3)), in a clean, modern style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: soft natural daylight with warm reflections, ultra photorealistic, highlighting fabric textures, skin details, and the overall calm ambiance, depth of field, crisp focus, HD quality.",
  "Outdoor_Alley3_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed, confident pose, one hand gently holding sunglasses and the other hanging naturally by her side, exuding a chic and effortless style 1.3)), ((outdoor street scene with a warm light-colored stone wall, a vintage wooden door with geometric glasswork, and cobblestone flooring, softly illuminated by natural sunlight 1.3)), in a clean, sophisticated style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: bright natural daylight creating soft shadows, ultra photorealistic, highlighting the textures of the fabric, skin details, and the warm tones of the backdrop, depth of field, crisp focus, HD quality.",
  "Indoor_Room2_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, exuding modern elegance and confidence 1.3)), ((modern indoor living space with light-colored flooring, neutral walls, a minimalist round coffee table with a white vase containing pampas grass, and soft decorative accents 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with emphasis on the model’s pose and outfit, Lighting: bright, even indoor lighting, ultra photorealistic, highlighting the garment’s texture, skin details, and the soft ambiance of the room, depth of field, crisp focus, HD quality.",
  "Indoor_Room3_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed, elegant pose, one hand gently resting by her side, the other holding the dress slightly open at the slit, exuding grace and confidence 1.3)), ((modern minimalist indoor space with light glossy marble flooring, a smooth light gray wall, and a large sheer curtain on the left allowing soft natural light to filter into the room 1.3)), in a clean, highly detailed style, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with emphasis on the model and her elegant pose, Lighting: soft natural daylight from the sheer curtain, ultra photorealistic, highlighting the fabric textures, skin details, and the minimalist surroundings, depth of field, crisp focus, HD quality.",
  "Indoor_Sofa2_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, one hand resting naturally by her side, exuding modern elegance and confidence 1.3)), ((modern indoor living space with a smooth white wall, large black-framed windows next to a minimalist white sofa, soft natural daylight pouring in through the windows, and a sleek side table with a vase 1.3)), in a clean, sophisticated style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with emphasis on the model, Lighting: bright natural daylight from the windows, ultra photorealistic, highlighting fabric textures, skin details, and the minimalist decor, depth of field, crisp focus, HD quality.",
  "Outdoor_Alley4_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing, ((standing full body with a confident and relaxed pose, one hand holding a stylish straw handbag, exuding a chic and carefree vibe 1.3)), ((rustic outdoor setting with a weathered white brick wall, large wooden double doors with rich textures and grain, enhanced by bright, lively natural daylight creating vibrant reflections and shadows 1.3)), in a clean, modern style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with emphasis on the model and her outfit, Lighting: enhanced bright natural daylight with deep contrast, vibrant color saturation, ultra photorealistic, highlighting fabric textures, skin details, and the rustic yet lively backdrop, depth of field, crisp focus, HD quality.",
  "Concrete Wall_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, one hand resting on her hip, the other by her side, exuding a casual and confident vibe 1.3)), ((indoor setting with a raw light grey concrete wall featuring natural speckles, warm-toned wooden plank flooring, and 2 modern black pendant lights hanging above — evoking a minimalist industrial aesthetic 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft, diffused natural daylight, ultra photorealistic, highlighting fabric textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Wall Panel_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, one hand resting on her hip, the other by her side, exuding a casual and confident vibe 1.3)), ((editorial-style indoor corner featuring white rectangular wall panel molding, a warm-toned wooden floor with soft gloss, and a tall glass vase with dried beige pampas grass. evoking a refined studio-meets-home aesthetic 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft, diffused natural daylight, ultra photorealistic, highlighting fabric textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Lilac Pot_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing  ((standing full body with a relaxed pose, one hand resting on her hip, the other by her side, exuding a casual and confident vibe 1.3)), ((Mediterranean outdoor setting with textured whitewashed plaster walls, rustic stone steps on the left, a large terracotta urn on the right filled with purple flowers and greenery, and uneven cobbled flooring — evoking classic southern European charm 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft, diffused natural daylight, ultra photorealistic, highlighting fabric textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Glass Room_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body in a relaxed pose, gently leaning against a white French door, one leg slightly bent and a natural smile on her face, exuding a calm and charming vibe 1.3)), ((sun-filled indoor conservatory featuring white French doors with clear glass panels, smooth light wood flooring, a white bistro table with a clear vase of flowers and pastries, and lush green garden foliage visible outside — evoking a warm, peaceful summer ambiance 1.3)), in a clean, lifestyle editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with soft upper-body emphasis, Lighting: bright diffused natural daylight, ultra photorealistic, highlighting textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Granny room_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing in a relaxed pose with one leg slightly bent, one hand holding a neutral-toned handbag, exuding a composed and stylish café vibe 1.3)), ((indoor setting with textured off-white stucco walls, light-toned vintage wood flooring, a rustic wooden dining table with curved chairs on the side, a crocheted table throw, and a muted antique rug — evoking a warm, natural, artisanal ambiance 1.3)), in a lifestyle editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with slight lower-angle emphasis to elongate the silhouette, Lighting: soft ambient natural light, ultra photorealistic, highlighting fabric texture, skin detail, and footwear, depth of field, crisp focus, HD quality.",
  "Pink Flower_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body in a carefree pose, one hand brushing her hair back, the other loosely by her side, exuding effortless summer charm 1.3)), ((sun-drenched cream plaster wall with cascading crimson bougainvillea flowers from the top edge, casting soft floral shadows — evoking a vibrant Mediterranean summer setting 1.3)), in a clean, sunlit lifestyle editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: strong natural sunlight with crisp shadows, ultra photorealistic, highlighting fabric drape, skin glow, and natural ambiance, depth of field, crisp focus, HD quality.",
  "Green sofa_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a composed, elegant pose — arms relaxed, posture upright, exuding confidence and poise 1.3)), ((luxurious indoor setting with a matte charcoal black panelled wall, a plush emerald green velvet sofa, a light grey rug, herringbone dark wood flooring, and a leafy potted plant on the left — evoking an upscale and refined ambiance 1.3)), in a clean, high-fashion editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot from slightly below eye level, Lighting: moody ambient lighting with soft highlights and shadow play, ultra photorealistic, emphasizing fabric luster, silhouette definition, and interior textures, depth of field, crisp focus, HD quality.",
  "White wall_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body in a confident pose, arms relaxed, one foot slightly forward, exuding quiet strength and minimalist sophistication 1.3)), ((indoor industrial studio space with a white painted brick wall, and a gray concrete floor — creating a crisp, neutral-toned modern fashion environment 1.3)), in a clean, editorial fashion style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body eye-level shot, Lighting: soft spotlight  with gentle shadows, ultra photorealistic, emphasizing fabric structure, body silhouette, and interior textures, depth of field, crisp focus, HD quality.",
  "Wall flowers_women": "Generate a scene of a young European female model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a gentle, relaxed pose, one arm resting at her side, exuding grace and springtime elegance 1.3)), ((outdoor setting with a white-painted brick wall and a sparse scattering of soft pink flowers and delicate vine strands gently cascading from the top — offering a minimal, airy, and subtly romantic backdrop 1.3)), in a clean, soft editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body eye-level shot, Lighting: soft natural daylight, ultra photorealistic, highlighting pastel fabric tones, skin glow, and floral ambiance, depth of field, crisp focus, HD quality.",
  "Backyard": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing  ((standing in a stylish outdoor courtyard, one hand on his hip and the other casually placed in his pocket)), ((modern courtyard with clean lines, concrete walkways, potted plants, and geometric sculptures in the background, creating an artistic and minimalistic urban setting 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: soft, even sunlight with a hint of shadows, highlighting the model’s silhouette and the smooth texture of the outfit. Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Hotel Lobby": "Generate a half body scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((in a relaxed pose in a modern, bright hotel lobby, one hand resting on his hip and the other holding a small leather messenger bag, with a composed expression 1.3)), ((bright and spacious hotel lobby with light wood paneling, polished floors, modern lighting, and contemporary furniture with minimalist décor, creating a fresh and welcoming atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: bright, neutral hotel lighting that illuminates the model and outfit perfectly, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Office1": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently through a bright, themed office lobby, exuding a poised and professional demeanor 1.3)), ((high-end corporate office with floor-to-ceiling glass windows, polished marble flooring, contemporary decor, and a sleek reception desk, bathed in natural daylight 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, side angle, Lighting: bright lighting with soft shadows to emphasize the outfit, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Street1": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently along a stylish urban street, exuding effortless summer elegance and confidence 1.3)), ((modern city street with clean sidewalks, neutral-toned buildings with large glass windows, subtle architectural details, and soft natural lighting creating a balanced and professional atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: mid-length shot, slightly angled perspective, Lighting: soft and even, avoiding dramatic highlights or strong shadows, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Wooden pier by the lake": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing confidently on a wooden pier, one hand resting casually on his hip, the other holding a stylish leather duffle bag, exuding a relaxed and stylish vibe 1.3)), ((simple wooden pier with natural wood grain and weathered planks, minimalistic and rustic with soft lighting filtering through nearby trees, offering a clean and calm atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly low angle to capture the model and the wooden pier’s texture. Lighting: gentle natural sunlight, creating soft shadows and highlights on the wooden surface, enhancing the model’s silhouette and outfit. Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Botanical glasshouse": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands:1.4)), wearing ((standing confidently in a botanical glasshouse, one hand resting casually on his hip, the other holding a stylish messenger bag, exuding a relaxed and stylish vibe:1.3)), ((sunlit glasshouse interior with tall arched windows, large tropical plants, potted greenery, and a stone-tiled floor, dappled sunlight filtering through leaves creating soft light patterns:1.3)), in a clean style, detailed, ((professional apparel photography:1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly low angle to capture the model framed by plants and light. Lighting: natural diffused sunlight, soft shadows and warm highlights, enhancing fabric and silhouette. Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Rooftop": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands:1.4)), wearing ((standing confidently on a sunlit rooftop terrace, one hand resting casually in his pocket while the other hangs loosely by his side, exuding a cool, relaxed vibe:1.3)), ((modern rooftop with light concrete flooring, glass railings, a few potted plants, and soft shadows cast by nearby structures, overlooking a subtle city skyline:1.3)), in a clean style, detailed, ((professional apparel photography:1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, straight-on, Lighting: soft natural light with even shadowing, ensuring the model and outfit are clearly highlighted. Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Sidewalk View": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing((set against an elegant European-style cityscape with classic beige stone buildings, large windows, and greenery-filled window boxes, creating a cozy and urban aesthetic 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: Half-body shot, Lighting: soft natural daylight with subtle shadows, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Green tropical leaves": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((posing gracefully against a textured white brick wall adorned with green tropical leaves, exuding an effortlessly chic and modern vibe 1.3)), ((bright outdoor-inspired studio setup with soft natural lighting, creating a fresh and stylish atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: mid-length shot, slightly angled perspective, Lighting: soft and even to highlight fabric textures, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Mediterranean courtyard": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking gracefully along spacious stone steps in a Mediterranean courtyard, exuding an elegant yet casual vibe 1.3)), ((greenery, creating a serene and inviting ambiance 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly angled perspective, Lighting: warm and natural, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Town setting": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking gracefully along a picturesque Mediterranean street, exuding effortless elegance and a summer-ready look 1.3)), ((rustic European town setting with warm yellow stucco walls, deep green wooden shutters, cobblestone streets, and vibrant pink bougainvillea cascading from above, creating a dreamy and charming atmosphere 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: mid-length shot, slightly angled perspective, Lighting: soft natural sunlight for a warm and inviting feel, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Garden": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking gracefully through a spacious garden, exuding effortless summer elegance and confidence 1.3)), ((open garden with a white picket fence, well-manicured green grass, and soft natural light evenly illuminating the scene, creating a serene and refreshing ambiance 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: mid-length shot, slightly angled perspective, Lighting: soft and even, avoiding dramatic highlights or strong shadows, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Courtyard ": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((model standing staightly  a white Mediterranean-style wall, hands softly by his side, expression serene and elegant 1.3)), ((sunlit outdoor courtyard with blooming bougainvillea tree, rustic stairs, and textured whitewashed walls in a warm European village setting 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body pose, Lighting: golden hour sunlight with soft shadows, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Urban street": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing  ((walking confidently on a city sidewalk)), ((modern urban street setting with textured walls, light stone pavement, and subtle background elements like a bicycle and warm sunlight 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body pose, Lighting: soft natural daylight with gentle contrast, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Vintage urban ": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing  ((model standing on an old city street with a nostalgic look, arms gently relaxed by his sides, head tilted slightly back with a soft smile 1.3)), ((vintage urban background with weathered stone buildings, creeping red vines, and rustic doors in an Armenian town setting 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body pose, Lighting: soft overcast daylight, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Rustic mustard-yellow wall": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing in a relaxed pose 1.3)), ((in front of a mustard-yellow wall with a traditional and decorative flowers, huge plants in the street)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body front facing shot, Lighting: natural soft daylight, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "European plaza": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently across a grand European plaza, exuding a bold and fashion-forward urban look 1.3)), ((elegant and empty European courtyard featuring detailed stone architecture, large arched windows, and clean symmetrical elements with no people in the background, creating a calm and refined setting 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body facing shot, side angle, Lighting: natural daylight, soft and even, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "White stone": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently along a sunlit neoclassical city street, exuding minimal elegance and a sharp summer style 1.3)), ((urban street with white stone architecture, tall pillars, arched windows, and a clean sidewalk, bathed in soft daylight with no visual clutter or people around, creating a refined and architectural ambiance 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, street-level angle, Lighting: soft natural daylight with crisp shadows, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "European street": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking confidently along a sunlit cobblestone alleyway in a quaint southern European town, exuding relaxed summer charm and effortless style 1.3)), ((narrow European street, rustic wooden doors, climbing ivy, scattered terracotta pots, flowers:1, and soft natural daylight casting gentle shadows for a cozy, lived-in Mediterranean vibe 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, Lighting: soft natural daylight, evenly lit with no harsh highlights, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Seafront": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking effortlessly along a bright wooden coastal pier, exuding carefree summer energy and fresh coastal charm 1.3)), ((open seafront boardwalk with light wood planks, clear blue water, soft horizon, minimal boats in the distance:1.5, and clean sky with gentle breeze moving the hair and outfit 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, Lighting: bright natural sunlight with soft shadows, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Courtyard2": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking slowly through a sunlit Mediterranean villa courtyard, exuding calm confidence and effortless resort style 1.3)), ((courtyard, aged wooden doors, stone flooring, arched windows, potted olive trees, flowers, and climbing vines bathed in warm natural daylight 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly angled, Lighting: soft golden daylight with natural contrast, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Modern art": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body,stubbed beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing confidently outside a modern art museum:1.2, exuding strong minimalism and high-fashion street elegance 1.3)), ((architectural space:1 with sharp geometric lines:1, white concrete walls, glass panels:1, open plaza flooring, and soft natural light casting defined shadows for a futuristic urban aesthetic 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, front angle, Lighting: bright natural light with architectural shadows, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Linen-draped": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing calmly in a linen-draped indoor corner, exuding softness, warmth, and natural elegance 1.3)), ((minimal space with plain walls in light beige tones, floor-to-ceiling white linen curtains flowing gently, and natural wood flooring — no people or props in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, front-facing, Lighting: soft, filtered natural light through curtains, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Sandy coastal": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking along a sandy coastal path, exuding effortless coastal charm and understated confidence 1.3)), ((natural setting with soft sand underfoot, wooden dune fencing on both sides, sparse beach grass, and a clear blue sky above — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly side angle, Lighting: natural blue sky scene with  highlights, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Pastel courtyard": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking through a pastel-toned courtyard, exuding feminine ease and quiet confidence 1.3)), ((open courtyard with peach and muted yellow walls, light ceramic tiled flooring, arched doorways, and subtle greenery in terracotta pots — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly angled perspective, Lighting: soft natural daylight with warm pastel reflections, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Pebble-paved path": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking slowly along a detailed pebble-paved path, exuding effortless grace and calm summer confidence 1.3)), ((clearly visible pebble stone flooring in light neutral tones, flanked by whitewashed textured walls, rustic wooden doors, potted green plants, and climbing ivy across the corners — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly downward angle, Lighting: natural daylight with crisp, even shadows, Contrast Color, ultra photorealistic, highlighting both outfit and background textures and details, full focus, HD quality.",
  "Sunlit Mediterranean alley": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking casually through a narrow sunlit Mediterranean alley, exuding fresh summer charm and confident ease 1.3)), ((fully detailed background with warm pastel-toned stucco walls, stone pavement, arched wooden doorways, green window shutters, and bougainvillea vines climbing the walls — all clearly in focus, no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly side-facing, Lighting: direct natural sunlight with crisp shadows, Contrast Color, ultra photorealistic, sharp focus on both model and intricate background elements, highlighting textures and details, HD quality.",
  "Villa-style stone pathway": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking along a villa-style stone pathway, exuding laid-back elegance and Mediterranean warmth 1.3)), ((fully detailed background with textured beige stone pavement, light sandstone walls, arched doorways, climbing vines, and potted plants along the path — all clearly visible and in focus, no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly side angle, Lighting: natural daylight with warm highlights and crisp shadows, Contrast Color, ultra photorealistic, sharp focus on both model and background, highlighting textures and details, HD quality.",
  "Loft-style indoor space": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing confidently in a loft-style indoor space with exposed brick walls, exuding contemporary style and artistic edge 1.3)), ((fully detailed background featuring warm red or whitewashed brick walls, tall industrial windows with black metal framing, polished concrete flooring, and potted plant placed nearby — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)).  Lighting: soft natural light from large windows with defined but gentle shadows, Contrast Color, ultra photorealistic, sharp focus on both model and environment textures, HD quality.",
  "Sunlit city sidewalk": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((walking casually along a sunlit city sidewalk, exuding everyday confidence and fresh summer style 1.3)), ((fully detailed background featuring neutral-toned storefronts, stone pavement, clean signage, planters along the walkway, and natural light 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, eye-level, Lighting: natural light with gentle shadows, Contrast Color, ultra photorealistic, sharp focus on both model and surroundings, HD quality.",
  "Stone-paved cafe": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing casually on a stone-paved café terrace, exuding relaxed charm and everyday elegance 1.3)), ((fully detailed background featuring textured stone flooring, with modern café, light neutral-toned building, some potted plants, and clean sunlight — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly front-facing, Lighting: natural soft daylight with ambient shadows, Contrast Color, ultra photorealistic, sharp focus on both model and environment, HD quality.",
  "Whitewashed villa terrace": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing confidently on a whitewashed villa terrace, exuding relaxed elegance and summery poise 1.3)), ((fully detailed background featuring smooth white stucco walls, exposed wooden beams overhead, terracotta ceramic planters with greenery, and patterned floor tiles under soft natural light — no people in the background 1.3)), in a clean style, detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: half-body shot, slightly side-facing, Lighting: soft Mediterranean daylight with light shadows from beams, Contrast Color, ultra photorealistic, sharp focus on both model and surrounding textures, HD quality.",
  "Outdoor running track": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, brown hair, with ((perfectly drawn hands 1.4)), wearing ((posing confidently while standing in a side pose on an outdoor running track, hands relaxed by the sides, with a focused and calm expression)), ((background 1.3 – vibrant outdoor park with lush green trees, a clean and well-maintained running track, and soft daylight casting natural shadows)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: natural outdoor lighting, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Gym Background": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, stubble beard, brown hair, with ((perfectly drawn hands 1.4)), wearing ((standing confidently in an indoor gym environment with a relaxed yet athletic presence 1.3)), ((spacious gym with high ceilings, natural light pouring through large glass windows, bright white walls, and polished wooden floors, flooded with bright, clean daylight, making the space feel open and airy 1.6)), in a clean style, detailed, ((professional apparel photography 1.4)). Lighting: bright natural daylight, enhancing the gym's cleanliness and light-filled atmosphere, Contrast Color, ultra photorealistic, highlighting textures and details, crisp focus, HD quality.",
  "Indoor_Sofa1": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed pose, hands by his side, exuding a casual and confident vibe 1.3)), ((modern indoor setting with dark wooden flooring, a light beige sofa with minimal cushions, and a soft, inviting ambiance 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft, diffused natural daylight, ultra photorealistic, highlighting fabric textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Indoor_Closet": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed, confident pose, one hand in pocket, other at his side 1.3)), ((minimal walk-in closet setting with light wood flooring, clean white walls, and a clothing rack displaying neatly organized neutral-toned garments 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft natural daylight, ultra photorealistic, highlighting fabric texture, depth of field, crisp focus, HD quality.",
  "Indoor_Dining": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed and confident pose, one hand resting naturally by his side, exuding effortless elegance and charm 1.3)), ((indoor dining area with light wood flooring, a single wooden dining table with four cross-legged chairs around it, no additional furniture or clutter in the background, and simple greenery in the background 1.3)), in a clean, minimalistic style with a cozy ambiance, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle focus on the upper body, Lighting: soft natural daylight, ultra photorealistic, highlighting fabric texture, skin details, and the simple yet elegant furnishings, depth of field, crisp focus, HD quality.",
  "Indoor_Landing": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed pose, one hand casually resting on his side, the other by his side, exuding effortless elegance 1.3)), ((simple staircase landing area with soft neutral carpeting, clean white walls, and a set of stairs with a wooden handrail, softly illuminated by natural light 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, ensuring the model’s face is visible and framed naturally, Lighting: soft natural daylight from an open doorway, ultra photorealistic, highlighting the textures of the clothing, skin tones, and accessories, with subtle depth of field, crisp focus, HD quality.",
  "Indoor_Room1": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a confident, relaxed pose, one hand lightly resting on a chair, the other by his side, exuding chic elegance 1.3)), ((indoor modern living space with light wood flooring, a geometric rug, large windows letting in natural daylight, and soft greenery visible outside 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: soft natural daylight with a touch of overhead chandelier light, ultra photorealistic, highlighting the garment's texture, skin details, and the soft play of light, depth of field, crisp focus, HD quality.",
  "Indoor_Bedroom": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed, confident pose, hands by his side, maintaining a natural, proportional scale that aligns with the room’s size 1.3)), ((simple, clean, and minimalistic bedroom with dark wood flooring, a white bed with neutral bedding, and a small side table beside the bed — ensuring the model’s proportions are in perfect harmony with the furniture and the room's space 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, ensuring the model's scale is natural relative to the surroundings, Lighting: soft natural daylight or gentle indoor light, ultra photorealistic, highlighting fabric textures, skin details, and room elements, with proper depth of field, crisp focus, HD quality.",
  "Outdoor_Alley2": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed, confident pose, one hand naturally by his side, the other slightly bent with a casual, effortless stance 1.3)), ((outdoor urban setting with a clean, light-colored wall, black-framed window to the left, and a gray sidewalk at the base of the image, softly illuminated by bright natural daylight 1.3)), in a clean, modern style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: bright natural daylight with soft shadows, ultra photorealistic, highlighting the garment’s texture, skin details, and natural pose, with crisp focus, depth of field, and HD quality.",
  "Outdoor_Dining": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed pose, one hand resting naturally by his side, the other holding the shoulder, exuding effortless style and confidence 1.3)), ((outdoor café area with light wood flooring, a smooth beige textured wall, simple wooden chairs, and soft natural daylight filtering through the space 1.3)), in a clean, modern style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: soft natural daylight with warm reflections, ultra photorealistic, highlighting fabric textures, skin details, and the overall calm ambiance, depth of field, crisp focus, HD quality.",
  "Outdoor_Alley3": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearin, ((standing full body with a relaxed, confident pose, one hand gently holding sunglasses and the other hanging naturally by his side, exuding a chic and effortless style 1.3)), ((outdoor street scene with a warm light-colored stone wall, a vintage wooden door with geometric glasswork, and cobblestone flooring, softly illuminated by natural sunlight 1.3)), in a clean, sophisticated style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: bright natural daylight creating soft shadows, ultra photorealistic, highlighting the textures of the fabric, skin details, and the warm tones of the backdrop, depth of field, crisp focus, HD quality.",
  "Indoor_Room2": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed pose, exuding modern elegance and confidence 1.3)), ((modern indoor living space with light-colored flooring, neutral walls, a minimalist round coffee table with a white vase containing pampas grass, and soft decorative accents 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with emphasis on the model’s pose and outfit, Lighting: bright, even indoor lighting, ultra photorealistic, highlighting the garment’s texture, skin details, and the soft ambiance of the room, depth of field, crisp focus, HD quality.",
  "Indoor_Room3": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed, elegant pose, one hand gently resting by his side, the other holding the shirt slightly open at the slit, exuding grace and confidence 1.3)), ((modern minimalist indoor space with light glossy marble flooring, a smooth light gray wall, and a large sheer curtain on the left allowing soft natural light to filter into the room 1.3)), in a clean, highly detailed style, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with emphasis on the model and his elegant pose, Lighting: soft natural daylight from the sheer curtain, ultra photorealistic, highlighting the fabric textures, skin details, and the minimalist surroundings, depth of field, crisp focus, HD quality.",
  "Indoor_Sofa2": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing ((standing full body with a relaxed pose, one hand resting naturally by his side, exuding modern elegance and confidence 1.3)), ((modern indoor living space with a smooth white wall, large black-framed windows next to a minimalist white sofa, soft natural daylight pouring in through the windows, and a sleek side table with a vase 1.3)), in a clean, sophisticated style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with emphasis on the model, Lighting: bright natural daylight from the windows, ultra photorealistic, highlighting fabric textures, skin details, and the minimalist decor, depth of field, crisp focus, HD quality.",
  "Outdoor_Alley4": "Generate a scene of a young European male model (23 years old) with a white skin tone, a toned muscular body, light stubbled beard, brown hair, wearing  ((standing full body with a confident and relaxed pose, one hand casually resting by his side, exuding a chic and carefree vibe 1.3)), ((rustic outdoor setting with a weathered white brick wall, large wooden double doors with rich textures and grain, enhanced by bright, lively natural daylight creating vibrant reflections and shadows 1.3)), in a clean, modern style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with emphasis on the model and his outfit, Lighting: enhanced bright natural daylight with deep contrast, vibrant color saturation, ultra photorealistic, highlighting fabric textures, skin details, and the rustic yet lively backdrop, depth of field, crisp focus, HD quality.",
  "Concrete Wall": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, one hand resting on his hip, the other by his side, exuding a casual and confident vibe 1.3)), ((indoor setting with a raw light grey concrete wall featuring natural speckles, warm-toned wooden plank flooring, and 2 modern black pendant lights hanging above — evoking a minimalist industrial aesthetic 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft, diffused natural daylight, ultra photorealistic, highlighting fabric textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Wall Panel": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, one hand resting on his hip, the other by his side, exuding a casual and confident vibe 1.3)), ((editorial-style indoor corner featuring white rectangular wall panel molding, a warm-toned wooden floor with soft gloss, and a tall glass vase with dried beige pampas grass — evoking a refined studio-meets-home aesthetic 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft, diffused natural daylight, ultra photorealistic, highlighting fabric textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Lilac Pot": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a relaxed pose, one hand resting on his hip, the other by his side, exuding a casual and confident vibe 1.3)), ((Mediterranean outdoor setting with textured whitewashed plaster walls, rustic stone steps on the left, a large terracotta urn on the right filled with purple flowers and greenery, and uneven cobbled flooring — evoking classic southern European charm 1.3)), in a clean, minimalist style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with subtle emphasis on the upper body, Lighting: soft, diffused natural daylight, ultra photorealistic, highlighting fabric textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Glass Room": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body in a relaxed pose, a natural smile on his face, exuding a calm and charming vibe 1.3)), ((sun-filled indoor conservatory featuring white French doors with clear glass panels, smooth light wood flooring, a white bistro table with a clear vase of flowers and pastries, and lush green garden foliage visible outside — evoking a warm, peaceful summer ambiance 1.3)), in a clean, lifestyle editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with soft upper-body emphasis, Lighting: bright diffused natural daylight, ultra photorealistic, highlighting textures, skin details, and footwear, depth of field, crisp focus, HD quality.",
  "Granny room": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing in a relaxed pose with one leg slightly bent, exuding a composed and stylish café vibe 1.3)), ((indoor setting with textured off-white stucco walls, light-toned vintage wood flooring, a rustic wooden dining table with curved chairs on the side, a crocheted table throw, and a muted antique rug — evoking a warm, natural, artisanal ambiance 1.3)), in a lifestyle editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot with slight lower-angle emphasis to elongate the silhouette, Lighting: soft ambient natural light, ultra photorealistic, highlighting fabric texture, skin detail, and footwear, depth of field, crisp focus, HD quality.",
  "Pink Flower": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body in a carefree pose, one hand brushing his hair back, the other loosely by his side, exuding effortless summer charm 1.3)), ((sun-drenched cream plaster wall with cascading crimson bougainvillea flowers from the top edge, casting soft floral shadows — evoking a vibrant Mediterranean summer setting 1.3)), in a clean, sunlit lifestyle editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot, Lighting: strong natural sunlight with crisp shadows, ultra photorealistic, highlighting fabric drape, skin glow, and natural ambiance, depth of field, crisp focus, HD quality.",
  "Green sofa": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a composed, elegant pose — arms relaxed, posture upright, exuding confidence and poise 1.3)), ((luxurious indoor setting with a matte charcoal black panelled wall, a plush emerald green velvet sofa, a light grey rug, herringbone dark wood flooring, and a leafy potted plant on the left — evoking an upscale and refined ambiance 1.3)), in a clean, high-fashion editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body shot from slightly below eye level, Lighting: moody ambient lighting with soft highlights and shadow play, ultra photorealistic, emphasizing fabric luster, silhouette definition, and interior textures, depth of field, crisp focus, HD quality.",
  "White wall": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body in a confident pose, arms relaxed, one foot slightly forward, exuding quiet strength and minimalist sophistication 1.3)), ((indoor industrial studio space with a white painted brick wall, and a gray concrete floor — creating a crisp, neutral-toned modern fashion environment 1.3)), in a clean, editorial fashion style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body eye-level shot, Lighting: soft spotlight with gentle shadows, ultra photorealistic, emphasizing fabric structure, body silhouette, and interior textures, depth of field, crisp focus, HD quality.",
  "Wall flowers": "Generate a scene of a young European male model (23 years old) with ((perfectly drawn hands 1.4)), wearing ((standing full body with a gentle, relaxed pose, one arm resting at his side, exuding grace and springtime elegance 1.3)), ((outdoor setting with a white-painted brick wall and a sparse scattering of soft pink flowers and delicate vine strands gently cascading from the top — offering a minimal, airy, and subtly romantic backdrop 1.3)), in a clean, soft editorial style, highly detailed, ((professional apparel photography 1.4)). Camera Used: Sony Alpha, Camera Angle: full body eye-level shot, Lighting: soft natural daylight, ultra photorealistic, highlighting pastel fabric tones, skin glow, and floral ambiance, depth of field, crisp focus, HD quality."
}